#include <stdio.h>
/*习题1
int main()
{
    unsigned char i = 7; // 0-255
    int j = 0;
    for (; i > 0; i -= 3) // i==0的时候 才会停止
    {
        j++;
    }
    printf("%d\n", j); // 173
    return 0;
} */
// i  7 4 1 254  254/3=84....2  2 255  255/3=85....0     84+85+3+1=173

/*习题2
int main()
{
    int a = -3;
    unsigned int b = 2;
    long c = a + b;
    printf("%ld\n", c);   //-1
} */
//-3 的补码11111111111111111111111111111101
// 2  的补码10000000000000000000000000000010
//         11111111111111111111111111111111 补码   -1


/*习题3 
int fun(int a)
{
    a ^= (1 << 5) - 1;
    return a;
}

int main()
{
    printf("%d",fun(21));
    return 0;
}  */
// 00000001  00100000  ==32-1   31    
//00011111 - 31
//00010101 - 21
//00001010 - 10   相同为0  相异为1


