#include <stdio.h>
//1.练习1

int main() {
    char a = -1;// -1截断后存储在a中
    //1000000000000000000000000000001 - 原码
    //1111111111111111111111111111110 - 反码
    //1111111111111111111111111111111 - 补码
    //11111111 - 截断后
    signed char b = -1;
    //1111111111111111111111111111111 - 补码
    //11111111 - 截断后
    unsigned char c = -1;//其实一眼就能看出来 -1的补码是11111111  无符号就是255  8位二进制最高的表示范围
    //1111111111111111111111111111111 - 补码
    //11111111
    printf("a=%d,b=%d,c=%d", a, b, c);//a=-1,b=-1,c=255
    //c
    //11111111
    //0000000000000000000000011111111 - 整型提升  无符号 补0后  为正数  补码 原码相同 直接计算
    //有符号整型提升补首位字符  无符号直接高位补0
    return 0;
}


//2.练习2
//%u是打印无符号整数，认为内存中存放的补码对应的是一个无符号整数
/*
int main()
{
    char a = -128;
    //10000000000000000000000010000000
    //11111111111111111111111101111111
    //11111111111111111111111110000000 - 补码
    //10000000 - 截断
    //11111111111111111111111110000000  -  整型提升
    printf("%u\n", a);  //4294967168
    char b = 128;
    //00000000000000000000000010000000 - 整数 原 反 补 一样
    //10000000 - 截断
    //11111111111111111111111110000000 - 整型提升
    printf("%u\n", b);   //4294967168
    return 0;
}
*/


//3.练习3
/*
int main()
{
    int i = -20;
    //10000000000000000000000000010100 - 原码
    //11111111111111111111111111101011 - 反码
    //11111111111111111111111111101100 - 补码
    unsigned  int  j = 10;
    //00000000000000000000000000001010
    printf("%d\n", i + j);   //-10
    //11111111111111111111111111101100 - 补码
    //00000000000000000000000000001010 - 补码
    //11111111111111111111111111110110 - 补码+补码
    //10000000000000000000000000001001 - 取反后+1得到下面的
    //10000000000000000000000000001010 - -10
    return 0;
}
*/


//4.练习4
/*
int main()
{
    unsigned int i;   //无符号整型 没有负数
    for (i = 9; i >= 0; i--)   //无符号整数一定大于0 所以循环一直进行
    {
        printf("%u\n", i);   //死循环
    }
    return 0;
}
*/


//练习5
/*
int main()
{
    char a[1000];  //范围-128-127
    //0 -1 -2 -3 -4...-128 127 126....1 0   一个圆，一共255个值
    int i;
    for (i = 0; i < 1000; i++)
    {
        a[i] = -1 - i;
    }
    printf("%d", strlen(a));  //255
    return 0;
}
*/


//6.练习6
/*
unsigned char i = 0;  //0-255
int main()
{
    for (i = 0; i <= 255; i++)   //255后i++  char的值最大为255
    {
        printf("hello world\n");
    }
    return 0;
}

*/
